package src.com.lesson_2_3_4.array;

/*
        -30, -10, 23
        10, 50, 10
        -34, -34, 1
        -1, 2, -3
        5, -8, 2
заполните массив случайными уникальными числами в заданных границах
длина массива должна составлять 75% от длины отрезка
выведите числа отсортированными по возрастанию
левая граница отрезка не должна превышать правую
выводите сообщение об ошибке, если данные не соответствуют критериям:
Ошибка: количество чисел в строке не должно быть < 1 (-8)
Ошибка: длина массива должна быть > 0 (-3)
Ошибка: левая граница (50) > правой (31)
*/
public class ArrayUniqueNumberFiller {
    public static void main(String[] args) {

    }

    /**
     * Генерирует массив уникальных случайных целых чисел в заданном диапазоне и выводит их в
     * отсортированном порядке в консоль.
     * <p>
     * Длина массива составляет 75% от длины заданного диапазона Левая граница диапазона не должна
     * превышать правую границу Числа в массиве должны быть уникальными
     * <p>
     * Метод выводит сообщения об ошибке, если входные данные нарушают ограничения:
     * <li>Если левая граница больше правой границы
     * "Ошибка: левая граница (<leftBoundary>) > правой * (<rightBoundary>)"</li> Если вычисленная
     * длина массива равна 0 или отрицательна "Ошибка: длина массива должна быть > 0 *
     * (<calculatedLength>)" Если количество чисел для вывода в строке меньше 1. "Ошибка: количество
     * чисел в строке не должно быть < 1 (<perRowCount>)"
     * <p>
     * Метод не возвращает значение. Он непосредственно выводит отсортированный массив или
     * соответствующее сообщение об ошибке в консоль.
     */
    private static void generateAndPrintUniqueNumbersArray() {

    }
}

